# Clear Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemporaryGraphicsManager..::..Clear Method
TemporaryGraphicsManager Class See Also
---
Clear all temporary graphics objects managed by this manager.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void Clear()
```

Visual Basic
---
```text
Public Sub Clear
```

Visual C++
---
```text
public:
void Clear()
```

# See Also
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace